app/controllers/progress_controller.rb

SELECT  "progresses".* FROM "progresses" WHERE "progresses"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def edit
    prg_id = params[:prg_id]
    @prg = Progress.find(prg_id)

SELECT  "progresses".* FROM "progresses" WHERE "progresses"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "progresses" SET "is_compleate" = ?, "updated_at" = ? WHERE "progresses"."id" = ?  [["is_compleate", "f"], ["updated_at", "2017-12-06 12:09:33.380317"], ["id", 2]]
---
  def update

    prg = Progress.find(params[:prg_id])
    prg.name = params[:progress][:name]
    prg.is_compleate = params[:progress][:is_compleate]
    prg.save!