app/controllers/user_controller.rb

  def index
  #coms - 企業データ
  #hitorys[企業id][任意の番号]で進捗データの取得ができる
  #coms[任意番号]の中に必要な情報が全て入っている

  @coms = Company.all
---
SELECT "companies".* FROM "companies" WHERE (id = not NULL)

  def addcom_post
    @com = Company.new
    @com.name = params[:company][:name]#:companyってどこ？
    @com.memo = params[:company][:memo]
    @com.address = params[:company][:address]
    @com.url1 = params[:company][:url1]
    @com.url2 = params[:company][:url2]
    @com.save!
---
INSERT INTO "companies" ("name", "memo", "address", "url1", "url2", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "aaa"], ["memo", "aa"], ["address", "aaa"], ["url1", "aaa"], ["url2", "aaaa"], ["created_at", "2017-12-06 11:25:44.591860"], ["updated_at", "2017-12-06 11:25:44.591860"]]

  def addprogress_get
    @com = Company.find(params[:com_id])
---
SELECT  "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]

  def addprogress_post
    @pg = Progress.new
    @pg.company_id = params[:com_id]
    @pg.name = params[:progress][:name]
    @pg.is_compleate = params[:progress][:is_compleate]
    @pg.save!
---
INSERT INTO "progresses" ("company_id", "type", "name", "is_compleate", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["company_id", 1], ["type", 0], ["name", "ああ"], ["is_compleate", "t"], ["created_at", "2017-11-22 11:54:10.115599"], ["updated_at", "2017-11-22 11:54:10.115599"]]

  def deletecom
    com = Company.find(params[:id])
    com.destroy!
---
SELECT  "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "companies" WHERE "companies"."id" = ?  [["id", 3]]